wayne-love/sn_esp32/src/main.cpp
#include <Arduino.h>

#if defined(ESP8266)
  #include <ESP8266WiFi.h>
  #include <ESP8266WebServer.h>

#elif defined(ESP32)
  #include <WiFi.h>
  #include <WebServer.h>

#endif

#include <WiFiClient.h>
#include <WiFiManager.h>
#include <RemoteDebug.h>
#include <PubSubClient.h>
#include <LittleFS.h>
//#include <ArduinoJson.h>
#include <vector>
#include <time.h>
#include <TimeLib.h>
#if defined(LED_PIN)
#include "Blinker.h"
#endif
#include "WebUI.h"

#include "SpaInterface.h"
#include "SpaUtils.h"
#include "HAAutoDiscovery.h"

#if defined(ESP32)
#include <Preferences.h>
#endif

#ifndef DEBUG_ENABLED
    #define DEBUG_ENABLED
    RemoteDebug Debug;
#endif

// Define the threshold for detecting a fast reboot (within 20 seconds)
#define REBOOT_THRESHOLD 20

#if defined(ESP8266)
struct RTCData {
  int16_t magicNumber;  // Use a unique number to identify valid data
  int16_t rebootFlag;   // 1 start wifi manager on next boot
};
RTCData rtcData;
const int16_t MAGIC_NUMBER = 0xAAAA;
#endif

#if defined(ESP32)
Preferences preferences;  // For ESP32 reboot storage
#endif

unsigned long bootStartMillis;  // To track when the device started
bool rebootFlag = false;

SpaInterface si;

#if defined(LED_PIN)
Blinker led(LED_PIN);
#endif
WiFiClient wifi;
PubSubClient mqttClient(wifi);

WebUI ui(&si);



bool saveConfig = false;
ulong mqttLastConnect = 0;
ulong wifiLastConnect = millis();
ulong bootTime = millis();
ulong statusLastPublish = millis();
bool delayedStart = true; // Delay spa connection for 10sec after boot to allow for external debugging if required.
bool autoDiscoveryPublished = false;

String mqttServer = "";
String mqttPort = "";
String mqttUserName = "";
String mqttPassword = "";

String mqttBase = "";
String mqttStatusTopic = "";
String mqttSet = "";
String mqttAvailability = "";

String spaSerialNumber = "";

void saveConfigCallback(){
  saveConfig = true;
}

bool readRebootFlag() {
  bool retVal = false;

  #if defined(ESP8266)
    ESP.rtcUserMemoryRead(0, (uint32_t*)&rtcData, sizeof(rtcData));
    // Check if the magic number matches
    if (rtcData.magicNumber != MAGIC_NUMBER) {
      debugD("Invalid or uninitialized RTC memory.");
    } else {
      retVal = (rtcData.rebootFlag  == 1);
    }
  #elif defined(ESP32)
    preferences.begin("reboot_data", false);
    retVal = preferences.getBool("rebootFlag", false);
    preferences.end();
  #endif
  rebootFlag = retVal;
  return retVal;
}

void writeRebootFlag(bool flagValue) {
  rebootFlag = flagValue;
  #if defined(ESP8266)
    // Write MAGIC_NUMBER so we can validate the data when we read it later
    rtcData.magicNumber = MAGIC_NUMBER;
    rtcData.rebootFlag = flagValue?1:0;
    ESP.rtcUserMemoryWrite(0, (uint32_t*)&rtcData, sizeof(rtcData));
  #elif defined(ESP32)
    preferences.begin("reboot_data", false);
    preferences.putBool("rebootFlag", flagValue);
    preferences.end();
  #endif
}

void startWiFiManager(){
  writeRebootFlag(false);
  if (ui.initialised) {
    ui.server->stop();
  }

  WiFiManager wm;
  WiFiManagerParameter custom_mqtt_server("server", "MQTT server", mqttServer.c_str(), 40);
  WiFiManagerParameter custom_mqtt_port("port", "MQTT port", mqttPort.c_str(), 6);
  WiFiManagerParameter custom_mqtt_username("username", "MQTT Username", mqttUserName.c_str(), 20 );
  WiFiManagerParameter custom_mqtt_password("password", "MQTT Password", mqttPassword.c_str(), 40 );
  wm.addParameter(&custom_mqtt_server);
  wm.addParameter(&custom_mqtt_port);
  wm.addParameter(&custom_mqtt_username);
  wm.addParameter(&custom_mqtt_password);
  wm.setBreakAfterConfig(true);
  wm.setSaveConfigCallback(saveConfigCallback);
  wm.setConnectTimeout(300); //close the WiFiManager after 300 seconds of inactivity


  wm.startConfigPortal();
  debugI("Exiting Portal");

  if (saveConfig) {
    mqttServer = String(custom_mqtt_server.getValue());
    mqttPort = String(custom_mqtt_port.getValue());
    mqttUserName = String(custom_mqtt_username.getValue());
    mqttPassword = String(custom_mqtt_password.getValue());

    debugI("Updating config file");
    JsonDocument json;
    json["mqtt_server"] = mqttServer;
    json["mqtt_port"] = mqttPort;
    json["mqtt_password"] = mqttPassword;
    json["mqtt_username"] = mqttUserName;

    File configFile = LittleFS.open("/config.json","w");
    if (!configFile) {
      debugE("Failed to open config file for writing");
    } else {
      serializeJson(json, configFile);
      configFile.close();
      debugI("Config file updated");
    }
  }
}

// We check the EN_PIN every loop, to allow people to configure the system
void checkButton(){
#if defined(EN_PIN)
  if(digitalRead(EN_PIN) == LOW) {
    debugI("Initial buttong press detected");
    delay(100); // wait and then test again to ensure that it is a held button not a press
    if(digitalRead(EN_PIN) == LOW) {
      debugI("Button press detected. Starting Portal");
      startWiFiManager();

      ESP.restart();  // restart, dirty but easier than trying to restart services one by one
    }
  }
#endif
}

void checkRebootThreshold(){
  // Check if REBOOT_THRESHOLD seconds have passed since the boot time, then clear the reboot flag
  if (rebootFlag && millis() - bootStartMillis > (REBOOT_THRESHOLD * 1000)) {
    debugI("Clear reboot flag after %i seconds.", REBOOT_THRESHOLD);
    writeRebootFlag(false);
  }
}

bool shouldStartWiFiManager() {
  bool isSelectedRebootReason = false;

  #if defined(ESP8266)
    uint32_t resetReason = ESP.getResetInfoPtr()->reason;
    debugI("ESP8266 Reset Reason: %d", resetReason);

    // Check selected reset reasons for ESP8266
    if (resetReason == REASON_SOFT_RESTART || resetReason == REASON_EXT_SYS_RST) {
      isSelectedRebootReason = true;
    }

  #elif defined(ESP32)
    esp_reset_reason_t resetReason = esp_reset_reason();
    debugI("ESP32 Reset Reason: %d", resetReason);

    // Check selected reset reasons for ESP32
    if (resetReason == ESP_RST_POWERON || resetReason == ESP_RST_EXT || resetReason == ESP_RST_SW) {
      isSelectedRebootReason = true;
    }
  #endif

  return (isSelectedRebootReason && rebootFlag);
}


void climateADPublish(String name, String propertyId, String deviceName, String deviceIdentifier ) {

