wayne-love/sn_esp32/src/main.cpp
  SpaAdConfig spa;
  spa.spaName = spaName;
  spa.spaSerialNumber = spaSerialNumber;
  spa.stateTopic = mqttStatusTopic;
  spa.availabilityTopic = mqttAvailability;

  //sensorADPublish("Water Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.water }}","measurement","WaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Heater Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heater }}","measurement","HeaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Case Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.case }}","measurement","CaseTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Mains Voltage","diagnostic","voltage",mqttStatusTopic,"V","{{ value_json.power.voltage }}","measurement","MainsVoltage", spaName, spaSerialNumber);
  //sensorADPublish("Mains Current","diagnostic","current",mqttStatusTopic,"A","{{ value_json.power.current }}","measurement","MainsCurrent", spaName, spaSerialNumber);
  //sensorADPublish("Power","","energy",mqttStatusTopic,"W","{{ value_json.power.energy }}","measurement","Power", spaName, spaSerialNumber);
  //sensorADPublish("Total Energy","","energy",mqttStatusTopic,"Wh","{{ value_json.totalenergy }}","total_increasing","TotalEnergy", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Ambient Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpAmbient }}","measurement","HPAmbTemp", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Condensor Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpCondensor }}","measurement","HPCondTemp", spaName, spaSerialNumber);
  //sensorADPublish("State","","",mqttStatusTopic,"","{{ value_json.status.state }}","","State", spaName, spaSerialNumber);
  
  SensorAdConfig sensorConfig;

  sensorConfig.displayName = "Water Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.water }}";
  sensorConfig.propertyId = "temperatures_water";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Case Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.case }}";
  sensorConfig.propertyId = "temperatures_case";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heater Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heater }}";
  sensorConfig.propertyId = "temperatures_heater";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heatpump Ambient Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heatpumpAmbient }}";
  sensorConfig.propertyId = "temperatures_heatpumpAmbient";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heatpump Condensor Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heatpumpCondensor }}";
  sensorConfig.propertyId = "temperatures_heatpumpCondensor";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Mains Voltage";
  sensorConfig.valueTemplate = "{{ value_json.power.voltage }}";
  sensorConfig.propertyId = "power_voltage";
  sensorConfig.deviceClass = "voltage";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "V";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Mains Current";
  sensorConfig.valueTemplate = "{{ value_json.power.current }}";
  sensorConfig.propertyId = "power_current";
  sensorConfig.deviceClass = "current";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "A";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Power";
  sensorConfig.valueTemplate = "{{ value_json.power.power }}";
  sensorConfig.propertyId = "power_power";
  sensorConfig.deviceClass = "power";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "W";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Total Energy";
  sensorConfig.valueTemplate = "{{ value_json.power.totalEnergy }}";
  sensorConfig.propertyId = "power_TotalEnergy";
  sensorConfig.deviceClass = "energy";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "kWh";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "State";
  sensorConfig.valueTemplate = "{{ value_json.status.state }}";
  sensorConfig.propertyId = "status_state";
  sensorConfig.deviceClass = "";
  sensorConfig.entityCategory = "";
  sensorConfig.stateClass = "";
  sensorConfig.unitOfMeasure = "";
  sensorAdJSON(output, sensorConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //binarySensorADPublish("Heating Active","",mqttStatusTopic,"{{ value_json.status.heatingActive }}","HeatingActive", spaName, spaSerialNumber);
  //binarySensorADPublish("Ozone Active","",mqttStatusTopic,"{{ value_json.status.ozoneActive }}","OzoneActive", spaName, spaSerialNumber);

  BinarySensorAdConfig binaryConfig;

  binaryConfig.displayName = "Heating Active";
  binaryConfig.valueTemplate = "{{ value_json.status.heatingActive }}";
  binaryConfig.propertyId = "status_heatingActive";
  binaryConfig.deviceClass = "heat";
  binarySensorAdJSON(output, binaryConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  binaryConfig.displayName = "Ozone Active";
  binaryConfig.valueTemplate = "{{ value_json.status.ozoneActive }}";
  binaryConfig.propertyId = "status_ozoneActive";
  binaryConfig.deviceClass = "running";
  binarySensorAdJSON(output, binaryConfig, spa, discoveryTopic);

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  
  climateADPublish(spaName,"Heating", spaName, spaSerialNumber);
  selectADPublish("Heatpump Mode",{"Auto","Heat","Cool","Off"}, mqttStatusTopic, "{{ value_json.heatpump.mode }}","heatpump_mode", spaName, spaSerialNumber);

  if (si.getPump1InstallState().startsWith("1") && !(si.getPump1InstallState().endsWith("4"))) {
     switchADPublish("Pump 1","",mqttStatusTopic,"{{ value_json.pumps.pump1.state }}","pumps_pump1_state",spaName,spaSerialNumber);
  }

  if (si.getPump2InstallState().startsWith("1") && !(si.getPump2InstallState().endsWith("4"))) {
    switchADPublish("Pump 2","",mqttStatusTopic,"{{ value_json.pumps.pump2.state }}","pumps_pump2_state",spaName,spaSerialNumber);
  }

  if (si.getPump3InstallState().startsWith("1") && !(si.getPump3InstallState().endsWith("4"))) {
    switchADPublish("Pump 3","",mqttStatusTopic,"{{ value_json.pumps.pump3.state }}","pumps_pump3_state",spaName,spaSerialNumber);
  }

  if (si.getPump4InstallState().startsWith("1") && !(si.getPump4InstallState().endsWith("4"))) {
    switchADPublish("Pump 4","",mqttStatusTopic,"{{ value_json.pumps.pump4.state }}","pumps_pump4_state",spaName,spaSerialNumber);
  }

  if (si.getPump5InstallState().startsWith("1") && !(si.getPump5InstallState().endsWith("4"))) {
    switchADPublish("Pump 5","",mqttStatusTopic,"{{ value_json.pumps.pump5.state }}","pumps_pump5_state",spaName,spaSerialNumber);
  }

  switchADPublish("Aux Heat Element","",mqttStatusTopic,"{{ value_json.heatpump.auxheat }}","heatpump_auxheat",spaName,spaSerialNumber);
  lightADPublish("Lights","",mqttStatusTopic,"{{ value_json.lights }}","lights",spaName,spaSerialNumber);
  selectADPublish("Lights Speed",{"1","2","3","4","5"},mqttStatusTopic,"{{ value_json.lights.speed }}","lights_speed",spaName, spaSerialNumber);

  std::vector<String> sleepStrings(std::begin(si.sleepStringMap), std::end(si.sleepStringMap));
  selectADPublish("Sleep Timer 1",sleepStrings,mqttStatusTopic,"{{ value_json.sleepTimers.timer1.state }}", "sleepTimers_timer1_state", spaName, spaSerialNumber, "config");
  selectADPublish("Sleep Timer 2",sleepStrings,mqttStatusTopic,"{{ value_json.sleepTimers.timer2.state }}", "sleepTimers_timer2_state", spaName, spaSerialNumber, "config");
  textADPublish("Sleep Timer 1 Begin",mqttStatusTopic,"{{ value_json.sleepTimers.timer1.begin }}", "sleepTimers_timer1_begin", spaName, spaSerialNumber, "config", "[0-2][0-9]:[0-9]{2}");
  textADPublish("Sleep Timer 1 End",mqttStatusTopic,"{{ value_json.sleepTimers.timer1.end }}", "sleepTimers_timer1_end", spaName, spaSerialNumber, "config", "[0-2][0-9]:[0-9]{2}");
  textADPublish("Sleep Timer 2 Begin",mqttStatusTopic,"{{ value_json.sleepTimers.timer2.begin }}", "sleepTimers_timer2_begin", spaName, spaSerialNumber, "config", "[0-2][0-9]:[0-9]{2}");
  textADPublish("Sleep Timer 2 End",mqttStatusTopic,"{{ value_json.sleepTimers.timer2.end }}", "sleepTimers_timer2_end", spaName, spaSerialNumber, "config", "[0-2][0-9]:[0-9]{2}");

